# 이번장에서는 데이터 분석하기 기초를 배우도록 한다.
# 데이터를 분석하기 위해서는 일단 데이터를 가져와야 함.

exam <- read.csv("csv_exam.csv")
exam

# head() 함수는 데이터의 양이 상당히 많을 수 있기 때문에 앞부분만 가져와서
# 어떻게 데이터가 구성되어있는지 확인할때 사용된다.
head(exam)
head(exam, 11)

# tail 함수는 뒤에서 가져오는 것 외에 head()와 다른 점이 없다.
tail(exam)
tail(exam, 9)

# View()함수는 실제 excel과 유사하게 화면에 데이터를 보여주는 함수이다.
# 반드시 V는 대문자로 해야한다. 함수에는 대소문자가 섞여 있는 것이 많다.
View(exam)

# dim()함수는 dimensions(차원)의 약자로 데이터의 행렬을 나타낸다.
# 앞서 배웠듯 행은 하나의 데이터값이고, 열은 컬럼, 속성, 변수라고 한다.
dim(exam) # 20행 5열이 출력된다.

# 속성을 알아보는 str()함수를 알아보자.
# 여기서 obs(observation) = 관측치 즉, 행의 갯수를 의미하고 variables는 변수(속성)의
# 갯수를 의미한다.
str(exam)

# 요약 통계량을 신출하는 함수인 summary()를 사용해보자.
summary(exam)

# summary()함수를 사용해서 출력하면 6개의 값이 산출된다. 이게 바로 기초분석인데
# 각각 설명하자면, Min : 최소값, 1st Qu : 1사분위수(1st Quantile) 하위 25% 지점에
# 위치하는 값, Median : 중앙값, Mean : 평균값, 3rd Qu : 3사분위수 하위 75% 지점에 위치하는 값
# Max : 최대값을 의미함.

# 과학 점수를 분석해보면 62.50을 기준으로 하여, 45.00에서 78.00 사이에 학생들의 점수가 쏠려 있다.
# 또한, 과학 최저점은 12점, 최고점은 98점, 평균은 59.45이다.

# mpg데이터 파악하기
# mpg데이터는 ggplot2패키지 안에 내장되어 있는 데이터이다.
# mpg변수에 as.data.frame()함수를 이용해서 데이터 속성을 데이터 프레임 형태로 바꾸어 저장중이다.
# 그리고 인자값인 ggplot2::mpg는 ggplot2패키지에 있는 mpg데이터를 가리키는 코드이다.
mpg <- as.data.frame(ggplot2::mpg)
View(mpg)

# 데이터가 234행에 변수 11개로 구성되어있다.
dim(mpg)

head(mpg)
tail(mpg)
View(mpg)

# 속성은 char(문자) num(소수점이 있는 실수, P/G언어에서 float나 double이다)
# int(소수점이 없는 정수) 중요한 것은 num과 int를 구별할 줄 알아야 한다.
str(mpg)

# 요약창을 본다. 각 속성들은 책을 참고하자.
summary(mpg)
# 여기서 hwy(고속도로 연비) cty(도시 연비)에 대해서 분석하고 발표해 보자.

# help를 이용하면 mpg데이터의 속성들에 대해 나와있다.
?mpg
