# 변수 x를 만들고 데이터 저장함.
x <- c(1, 2, 3)
x

# mean() 함수는 인자값(매개변수, parameter) 의 평균을 구하는 함수이다.
# 여기서 함수라는 개념이 중요한데, 함수는 변수와 다르게 함수명 뒤에 항상 ()가 붙는다.
# 꼭 기억하자. 어떤 언어라도 다 똑같다.
mean(x) # 결과값이 2가 출력된 것을 알 수 있다.

# 최대값 구하기
max(x)

# 최소값 구하기
min(x)

# 문자나 문자열을 다루는 함수 예제

# 변수 str5에 문자열을 가지는 값을 저장함.
str5 <- c("Hello!", "World", "is", "good!")
str5

# paste() 함수는 인자값을 가지고 문자나 문자열을 합치는 함수이다.
# 여기서 collapse는 함수의 인자값이다. 무엇이든 인자값을 통해서 결과를 바꿀 수도 있다.

paste(str5, collapse = ",") # 좌측은 str5에 있는 문자열을 쉼표를 구분자로 하여 합치는 명령임

# 함수의 결과물을 또다른 변수에 저장할 수 있다. 다시말해 이것을 반환값 혹은 리턴 값이라고도 한다.
x_mean <- mean(x)
x_mean

# 인자값을 "/"로 주었다.
str5_paste <- paste(str5, collapse = "/")
str5_paste